<template>
<section class="works2 mx-5 mt-7">
  <h2>お問い合わせフォーム</h2>
  
  <v-img src="https://library-ks.com/image/site2-1_2.png" height="200px" class="my-5 mx-auto" alt="お問い合わせフォームイメージ"></v-img>
  <p class="mx-10">
    React.jsを学んだ際にお問い合わせフォームを作成しました。ページの作成だけでなく環境構築から良い勉強になりました。<br>
    バックエンドの機能はEmailJsというサービスを利用し、スタイルは使用し慣れたCSSだけでなくMaterial UIも使用してみました。
    基本はそれぞれの公式ドキュメントを参照し、細かな機能面などはネット記事などを参照しました。
  </p>
  <p class="mx-10 mt-5">
    イメージや聞き慣れないことで新しいライブラリなどを使用することに躊躇してしまいがちでしたが、
    いざ使用してみると便利な部分やドキュメントを参照することでできることがあり、一歩踏み出して新たな環境でもキャッチしていきたいと思うようになりました。
  </p>
</section>
</template>